{
    "title":"Portfolio",
    "hello": "Hello! My name is",
    "name": "Diego",
    "resume": "I am a Software Development and Management Engineer. I graduated in 2022, but I have been immersed in the professional field since May 2020. Throughout my career, I have worked in various areas of my field, from QA tester to taking on developer roles, and currently serving as a Tech Leader.",
    "changeLanguage": "Change language",
    "about": "About",
    "skills":"Expertise",
    "contact":"Contact",
    "experience":"Experience",
    "introduction":"Introduction",
    "overview":"Overview.",
    "overviewText":"I began my professional development in May 2020 at Exos Technology, where I had the opportunity to work as an intern in the QA testing area. During this time, I acquired solid skills in unit and integration testing of software projects, as well as mastering comprehensive documentation and evidence file generation. My most notable contribution in QA was the implementation of test automation tools, such as SmartBear, Katalon, and Selenium. These tools were essential for automating software regression testing, allowing us to generate multiple scenarios and a comprehensive results matrix. This approach not only increased the efficiency of our development process, but also significantly improved the quality and consistency of the delivered software. Later on, I transitioned to the development area, where I played a key role in various projects and faced diverse challenges. At Exos, a company with a particular focus on the financial sector, I led the implementation of software solutions of various kinds; from creating simple microservices for dispute and clarification management, to developing sophisticated algorithms and implementing complex batch processes; I always actively participated in all aspects of development. My progression within the company led me to take on the role of technical leader, where, in addition to continuing to develop innovative solutions, I dedicated myself to planning (work plan generation), execution (progress review, testing), and successful delivery of all projects.",
    "frontend": "Frontend Developer",
    "backend": "Backend Developer",
    "ux": "UX/UI Design",
    "qa": "QA",
    "mySkills": "My skills",
    "techs": "Technologies.",
    "soFar": "What I've done so far...",
    "workExperience": "Work Experience.",
    "myResume": "My resume",
    "touch": "Get in touch",
    "contactTitle": "Contact.",
    "yourName": "Your Name",
    "yourEmail": "Your Email",
    "yourMsg": "Your Message",
    "send": "Send",
    "sendingMsg": "Thank you. I will get back to you as soon as possible.",
    "errorMsg":"Something went wrong. Please try again."
}
