{
    "title":"Portafolio",
    "hello": "!Hola!, Mi nombre es",
    "name": "Diego",
    "resume" : "Soy Ingeniero en Desarrollo y Gestión de Software. Me gradué en el año 2022, pero he estado inmerso en el ámbito profesional desde mayo de 2020. A lo largo de mi trayectoria, he laborado en diversas áreas de mi carrera, desde QA tester  hasta asumir roles de desarrollador, y actualmente ejerciendo como Tech Leader.",
    "changeLanguage": "Cambiar idioma",
    "about": "Acerca de",
    "skills":"Expertise",
    "projects":"Proyectos",
    "contact":"Contacto",
    "experience":"Experiencia",
    "introduction":"Introducción",
    "overview":"Resumen profesional.",
    "overviewText": "Comencé mi desarrollo profesional en mayo de 2020 en Exos Technology, donde tuve la oportunidad de desempeñarme como becario en el área de testing QA. Durante este tiempo, adquirí habilidades sólidas en pruebas unitarias e integrales de proyectos de software, además de dominar la documentación exhaustiva y la generación de archivos de evidencia. Mi contribución más destacada en QA fue la implementación de herramientas de automatización de pruebas, tales como SmartBear, Katalon y Selenium. Estas herramientas fueron fundamentales para automatizar las pruebas de regresión del software, permitiéndonos generar múltiples escenarios y una matriz completa de resultados. Este enfoque no solo aumentó la eficiencia de nuestro proceso de desarrollo, sino que también mejoró significativamente la calidad y la consistencia del software entregado. Tiempo después, me trasladé al área de desarrollo, donde desempeñé un papel fundamental en diversos proyectos y enfrenté desafíos variados. En Exos, una empresa con un enfoque particular en el sector financiero, lideré la implementación de soluciones de software de diversa índole. Desde la creación de microservicios simples para la gestión de controversias y aclaraciones, hasta la elaboración de algoritmos sofisticados al igual que la implementación de procesos batch complejos; siempre participando activamente en todos los aspectos del desarrollo. Mi progresión en la empresa me llevó a asumir el rol de líder técnico, donde además de seguir desarrollando soluciones innovadoras, me dediqué a la planificación (generación de plan de trabajo), ejecución (revisión de avances, pruebas) y entrega exitosa de todos los proyectos.",
    "frontend": "Desarrollador Frontend",
    "backend": "Desarrollador Backend",
    "ux": "Diseño UX/UI",
    "qa": "QA",
    "mySkills": "Mis habilidades",
    "techs": "Tecnologías.",
    "soFar": "Lo que he hecho hasta ahora...",
    "workExperience": "Experiencia laboral.",
    "touch": "Ponte en contacto",
    "contactTitle": "Contacto.",
    "yourName": "Tu nombre",
    "yourEmail": "Tu email",
    "yourMsg": "Tu mensaje",
    "send": "Enviar",
    "sending": "Enviando",
    "sendingMsg": "Gracias. Me comunicaré contigo lo antes posible.",
    "errorMsg":"Algo salió mal. Inténtalo de nuevo."
}